blog/complexity_theory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-01 Fri 06:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Complexity Theory</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Kalmane" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Complexity Theory</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1506ec7">1. What is a complex system?</a>
<ul>
<li><a href="#orgd7678c4">1.1. The human body</a></li>
<li><a href="#org8919e40">1.2. The stock market</a></li>
</ul>
</li>
<li><a href="#orgd1d036c">2. What are not complex systems?</a></li>
<li><a href="#org18cf60a">3. Why are complex systems interesting?</a>
<ul>
<li><a href="#orgd0f5ad9">3.1. They are unpredictable!</a></li>
<li><a href="#orgac39367">3.2. They somehow keep working!</a></li>
<li><a href="#org686d16d">3.3. They might result in black swan events</a></li>
</ul>
</li>
<li><a href="#org4ebe0d5">4. Why are complex systems important?</a></li>
<li><a href="#org8251cd7">5. Some questions</a>
<ul>
<li><a href="#org3a93ad4">5.1. How do we make non-complex systems complex</a></li>
<li><a href="#org35cac0e">5.2. Role of an individual agent in a complex system</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This page captures my initial thoughts about complexity theory
</p>
<div id="outline-container-org1506ec7" class="outline-2">
<h2 id="org1506ec7"><span class="section-number-2">1</span> What is a complex system?</h2>
<div class="outline-text-2" id="text-1">
<p>
A system that has diverse agents who are connected to each other and
interdependent, while being adaptive to changes would classify as a complex
system. To clarify this technical definition, some examples:
</p>
</div>
<div id="outline-container-orgd7678c4" class="outline-3">
<h3 id="orgd7678c4"><span class="section-number-3">1.1</span> The human body</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The human body has diverse agents (various organs which co-operate and
possibly compete for energy and resources) which are interdependent - and
these agents are adaptive - and change based upon various criteria like time,
state of other agents etc
</p>
</div>
</div>
<div id="outline-container-org8919e40" class="outline-3">
<h3 id="org8919e40"><span class="section-number-3">1.2</span> The stock market</h3>
</div>
</div>

<div id="outline-container-orgd1d036c" class="outline-2">
<h2 id="orgd1d036c"><span class="section-number-2">2</span> What are not complex systems?</h2>
<div class="outline-text-2" id="text-2">
<p>
To be a complex system, a system has to satisfy <b>all</b> the 4 criteria mentioned
above. It is important to realize that <b>complicated</b> does not mean
<b>complex</b>. A voice assistant system built on machine learning algorithms and
multiple cloud services may be 'complex' from a technical perspective, but
does not classify as a 'complex system'. This is because, while we could make
a case that it consists of diverse, connected, interdependent agents (ASR,
NLU, End Services etc), these agents are not adaptive.
</p>
</div>
</div>

<div id="outline-container-org18cf60a" class="outline-2">
<h2 id="org18cf60a"><span class="section-number-2">3</span> Why are complex systems interesting?</h2>
<div class="outline-text-2" id="text-3">
<p>
Complex systems have some really cool properties:
</p>
</div>
<div id="outline-container-orgd0f5ad9" class="outline-3">
<h3 id="orgd0f5ad9"><span class="section-number-3">3.1</span> They are unpredictable!</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Complex systems result in interesting bottom up emergent properties which are
unexpected and unpredictable. The chaotic traffic patterns in a bustling city
center are hard to predict and model, and are a result of numerous agents
making independent decisions. An example of such a bottom-up phenomena - the
wetness of water - individual water molecules are not 'wet', but when
combined - they cause the property of 'wetness'.
</p>
</div>
</div>
<div id="outline-container-orgac39367" class="outline-3">
<h3 id="orgac39367"><span class="section-number-3">3.2</span> They somehow keep working!</h3>
<div class="outline-text-3" id="text-3-2">
<p>
It is strange to realize that while these systems are immensely hard to grasp
and model, they somehow are fully functioning systems, and are quite fault
tolerant. In fact, they thrive. Going back to our traffic example, inspite of
the persistent chaos, somehow everybody makes it to their desired destination
almost all the time, on time!
</p>
</div>
</div>
<div id="outline-container-org686d16d" class="outline-3">
<h3 id="org686d16d"><span class="section-number-3">3.3</span> They might result in black swan events</h3>
<div class="outline-text-3" id="text-3-3">
<p>
While these systems are reasonably fault tolerant, they do result in some rather fat
tail events which might have immense consequences. These events are usually
hard to predict and hard to plan for.
</p>
</div>
</div>
</div>

<div id="outline-container-org4ebe0d5" class="outline-2">
<h2 id="org4ebe0d5"><span class="section-number-2">4</span> Why are complex systems important?</h2>
<div class="outline-text-2" id="text-4">
<p>
The world is becoming more and more complex. Today, we have more and more
connections between disparate groups of people and more adapatation as a
result. To help us make sense of this increasingly 
</p>
</div>
</div>

<div id="outline-container-org8251cd7" class="outline-2">
<h2 id="org8251cd7"><span class="section-number-2">5</span> Some questions</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org3a93ad4" class="outline-3">
<h3 id="org3a93ad4"><span class="section-number-3">5.1</span> How do we make non-complex systems complex</h3>
<div class="outline-text-3" id="text-5-1">
<p>
If we'd want to imbibe certain 'simple' man-made systems with the properties
of a complex system, how might we go about doing it? Would we want to?
</p>
</div>
</div>
<div id="outline-container-org35cac0e" class="outline-3">
<h3 id="org35cac0e"><span class="section-number-3">5.2</span> Role of an individual agent in a complex system</h3>
<div class="outline-text-3" id="text-5-2">
<p>
It seems that in a complex system, an individual is basically a cog in a
giant wheel, and it is hard to gauge their impact. Is it possible to actually
quantify a single agent's impact in such a system, since we seem to be
talking about aggregate impacts, and the results are also seen in the
aggregate.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kalmane</p>
<p class="date">Created: 2021-01-01 Fri 06:41</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
